[server]
port		=	6000	;本地端口
golden_code =	292		;本地金色代码

[world]
id			=	30001	;游戏世界ID
name		=	小三世界;游戏世界名称
section_id	=	90001	;大区ID
section_name =	Loong_yg ;大区名称
player_num_limit = 3000	;人数上限
save_num_per_tick = 1	;定时保存

[db_server]
ip = 172.17.3.13			;dbserver的ip
port = 5005				;dbserver的port
golden_code = 90100891			;dbserver的金色代码

[login_server]
ip = 172.17.3.13			;loginserver的ip
port = 5050				;loginserver的port
golden_code = 300			;loginserver的金色代码

[gm_server]
ip = 172.17.3.13			;gmserver的ip
port = 6600				;gmserver的端口

[bill_server]
ip = 172.17.3.13			;billserver的ip
port = 7123				;billserver的端口

[CA_info]
area		=	CN 
black_list	=	F:\CASolution\debug\Files\black.dat
certificate	=	F:\CASolution\debug\Files\10015Certificate.dat

[CA_svrlist]
num			=	1
ca_1		=	172.17.3.16
port_1		=	7000

[window]
width = 800				;窗口大小
height = 600				;窗口大小

[cheat]
lax_cheat_distance = 50			;外挂距离检测
strict_cheat_distance = 10		;外挂距离检测

[quest]					;任务属性的相关路径
path = data\system\quest
list = data\system\quest\quest.xml
acceptQuest_NPC_relation = data\system\quest\accept_quest_npc.data
completeQuest_NPC_relation = data\system\quest\complete_quest_npc.data

[loot]					;掉落属性的相关路径
creature_loot = data\system\attdata\loot_proto.xml
loot_item_set = data\system\attdata\loot_item_set_proto.xml
loot_quest_item = data\system\attdata\loot_quest_item_proto.xml

[script]				;脚本目录
path = server_data\script

[vip_netbar]				;金牌网吧路径
path = server_data\vip_netbar.xml

[house_keeping]			;清理
max_recv_wait_unit_num	= 64			;客户端等待处理的包的最大数量，超过数量将被踢掉
max_send_cast_unit_num	= 1000			;发送给客户端但还没有收到响应的包数量，超过数量将被踢掉
max_send_cast_size		= 2097152	;发送给客户端但还没有收到相应的字节数量，超过即被踢掉

[chat_log]
on = 0					;开启聊天log


